import random

kind = {
    '한식': ["김밥", "김치찌개", "김치볶음밥","떢볶이","라면","제육볶음","돼지국밥",'삼겹살','순대국밥','보쌈'],
    '일식': ['소바', '라멘','돈까쓰','스시','카레','우동'],
    '중식': ["짜장면","짬뽕","볶음밥","탕수육","마라탕","마라샹궈"],
    '양식': ['파스타','센드위치','피자','치킨'],
    '아무거나': ["김밥", "김치찌개", "김치볶음밥","떢볶이","라면","제육볶음","국밥",'삼겹살','소바', '라멘','돈까쓰',"짜장면","짬뽕","볶음밥","탕수육","마라탕","마라샹궈",'파스타','센드위치']
}

def recommendfood(arg):
    # 인덱스에 없을 경우 예외처리
    select_foodList = kind[arg]
    selected_food = random.choice(select_foodList)

    return selected_food
